1. StringIO
2. Pandas read_csv

In [1]:
from io import StringIO

In [2]:
import pandas as pd
df = pd.read_csv('mercedesbenz.csv')

In [3]:
df.head()

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
1,6,88.53,k,t,av,e,d,y,l,o,...,1,0,0,0,0,0,0,0,0,0
2,7,76.26,az,w,n,c,d,x,j,x,...,0,0,0,0,0,0,1,0,0,0
3,9,80.62,az,t,n,f,d,x,l,e,...,0,0,0,0,0,0,0,0,0,0
4,13,78.02,az,v,n,f,d,h,d,n,...,0,0,0,0,0,0,0,0,0,0

In [8]:
data = ('col1,col2,col3\n'
        'x,y,1\n'
        'a,2,c\n'
        'c,d,3')

In [9]:
type(data)

str

In [10]:
# in memory file format object
StringIO(data)

In [11]:
pd.read_csv(StringIO(data))

  col1 col2 col3
0    x    y    1
1    a    2    c
2    c    d    3

In [12]:
pd.read_csv(StringIO(data),usecols=['col1','col2'])

  col1 col2
0    x    y
1    a    2
2    c    d

In [13]:
df = pd.read_csv('mercedesbenz.csv', usecols=['X0','X1','X2','X3'])
df.head()

   X0 X1  X2 X3
0   k  v  at  a
1   k  t  av  e
2  az  w   n  c
3  az  t   n  f
4  az  v   n  f

In [14]:
df.to_csv('test.csv')

In [15]:
df.to_csv('test.csv',index=False)

In [19]:
## data types in csv
data = ('a,b,c,d\n'
       'e,f,g,h\n'
       '1,2,3,4\n'
       '5,6,7')

In [20]:
pd.read_csv(StringIO(data))

   a  b  c    d
0  e  f  g    h
1  1  2  3    4
2  5  6  7  NaN

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4209 entries, 0 to 4208
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   X0      4209 non-null   object
 1   X1      4209 non-null   object
 2   X2      4209 non-null   object
 3   X3      4209 non-null   object
dtypes: object(4)
memory usage: 131.7+ KB

In [22]:
df = pd.read_csv(StringIO(data), dtype = 'object')

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      object
 1   b       3 non-null      object
 2   c       3 non-null      object
 3   d       2 non-null      object
dtypes: object(4)
memory usage: 224.0+ bytes

In [24]:
df.head()

   a  b  c    d
0  e  f  g    h
1  1  2  3    4
2  5  6  7  NaN

In [25]:
df.isnull().sum()

a    0
b    0
c    0
d    1
dtype: int64

In [27]:
df['a']

0    e
1    1
2    5
Name: a, dtype: object

In [29]:
df['a'][0]

'e'

In [31]:
data = ('a,b,c,d\n''1,2,3,4\n''5,6,7,8\n''9,10,11')
df = pd.read_csv(StringIO(data), dtype = {'a':int,'b':float,'c':int})

In [32]:
df

   a     b   c    d
0  1   2.0   3  4.0
1  5   6.0   7  8.0
2  9  10.0  11  NaN

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int32
 1   b       3 non-null      float64
 2   c       3 non-null      int32
 3   d       2 non-null      float64
dtypes: float64(2), int32(2)
memory usage: 200.0 bytes

In [34]:
df.dtypes

a      int32
b    float64
c      int32
d    float64
dtype: object

In [35]:
# Using index cols and usecols
data = ('a,b,c\n'
        '4,apple,bat\n'
        '8,orange,cow')
pd.read_csv(StringIO(data), usecols=['a','b','c'], index_col=0)

        b    c
a
4   apple  bat
8  orange  cow